def get_row(result_dice: int):
    slot_values = {
        1: ("бар", "бар", "бар"),
        2: ("виноград", "бар", "бар"),
        3: ("лимон", "бар", "бар"),
        4: ("семёрка", "бар", "бар"),
        5: ("бар", "виноград", "бар"),
        6: ("виноград", "виноград", "бар"),
        7: ("лимон", "виноград", "бар"),
        8: ("семёрка", "виноград", "бар"),
        9: ("бар", "лимон", "бар"),
        10: ("виноград", "лимон", "бар"),
        11: ("лимон", "лимон", "бар"),
        12: ("семёрка", "лимон", "бар"),
        13: ("бар", "семёрка", "бар"),
        14: ("виноград", "семёрка", "бар"),
        15: ("лимон", "семёрка", "бар"),
        16: ("семёрка", "семёрка", "бар"),
        17: ("бар", "бар", "виноград"),
        18: ("виноград", "бар", "виноград"),
        19: ("лимон", "бар", "виноград"),
        20: ("семёрка", "бар", "виноград"),
        21: ("бар", "виноград", "виноград"),
        22: ("виноград", "виноград", "виноград"),
        23: ("лимон", "виноград", "виноград"),
        24: ("семёрка", "виноград", "виноград"),
        25: ("бар", "лимон", "виноград"),
        26: ("виноград", "лимон", "виноград"),
        27: ("лимон", "лимон", "виноград"),
        28: ("семёрка", "лимон", "виноград"),
        29: ("бар", "семёрка", "виноград"),
        30: ("виноград", "семёрка", "виноград"),
        31: ("лимон", "семёрка", "виноград"),
        32: ("семёрка", "семёрка", "виноград"),
        33: ("бар", "бар", "лимон"),
        34: ("виноград", "бар", "лимон"),
        35: ("лимон", "бар", "лимон"),
        36: ("семёрка", "бар", "лимон"),
        37: ("бар", "виноград", "лимон"),
        38: ("виноград", "виноград", "лимон"),
        39: ("лимон", "виноград", "лимон"),
        40: ("семёрка", "виноград", "лимон"),
        41: ("бар", "лимон", "лимон"),
        42: ("виноград", "лимон", "лимон"),
        43: ("лимон", "лимон", "лимон"),
        44: ("семёрка", "лимон", "лимон"),
        45: ("бар", "семёрка", "лимон"),
        46: ("виноград", "семёрка", "лимон"),
        47: ("лимон", "семёрка", "лимон"),
        48: ("семёрка", "семёрка", "лимон"),
        49: ("бар", "бар", "семёрка"),
        50: ("виноград", "бар", "семёрка"),
        51: ("лимон", "бар", "семёрка"),
        52: ("семёрка", "бар", "семёрка"),
        53: ("бар", "виноград", "семёрка"),
        54: ("виноград", "виноград", "семёрка"),
        55: ("лимон", "виноград", "семёрка"),
        56: ("семёрка", "виноград", "семёрка"),
        57: ("бар", "лимон", "семёрка"),
        58: ("виноград", "лимон", "семёрка"),
        59: ("лимон", "лимон", "семёрка"),
        60: ("семёрка", "лимон", "семёрка"),
        61: ("бар", "семёрка", "семёрка"),
        62: ("виноград", "семёрка", "семёрка"),
        63: ("лимон", "семёрка", "семёрка"),
        64: ("7", "7", "7"),
    }
    if result_dice == 64:
        return ''.join(slot_values.get(result_dice)).capitalize()
    else: 
        return ', '.join(slot_values.get(result_dice))

def get_point(result_dice: int):
    if result_dice in (1, 22, 43):
        return 3
    elif result_dice in (6, 11, 16, 17, 27, 32, 33, 38, 48, 49, 54, 59):
        return 2
    elif result_dice == 64:
        return 7
    else:
        return -1
    
def get_result_text(result_dice: int, bid: int):
    global gold
    result = get_point(result_dice=result_dice)
    point = result*bid
    
    combo = get_row(result_dice=result_dice)
    
    if result in (1,2,3,4,5,6):
        answer = f'Ваша комбинация: {combo}\nПоздравляем!\n'
        gold = point-bid
        super_pres = False
    
    elif result == 7:
        answer = f'Ваша комбинация: {combo}\nВы выиграли СУПЕР ПРИЗ!!!\n'
        gold = point-bid
        super_pres = True
    else:
        answer = f'К сожалению вы проиграли(\nВаша ставка сгорела!\n'
        gold = point
        super_pres = False
    return answer, gold, super_pres